{
    "game_title": "DJKAT CYOA",
    "scenarios": [
        {
            "id": 1,
            "time": "6:00 AM",
            "title": "Wake Up",
            "description": "The morning air hangs heavy with uncertainty as you rise. Recent infrastructure alerts have made it clear - the water and electricity you once took for granted are now precious commodities. Through your window, the dawn breaks over a city learning to adapt. As you prepare for your morning routine, each drop of water and volt of electricity feels more valuable than ever.",
            "options": [
                {
                    "name": "Take a cold shower",
                    "cost": {
                        "water": 10,
                        "electricity": 0,
                        "hp": 5
                    },
                    "justification": "Cold showers use significantly less water as they are shorter and require no water heating. The water flow is typically reduced to minimize discomfort, directly translating to lower water consumption while providing basic hygiene needs."
                },
                {
                    "name": "Take a hot shower",
                    "cost": {
                        "water": 20,
                        "electricity": 10,
                        "hp": 0
                    },
                    "justification": "Hot water requires extensive energy to heat, consuming both water and electricity. The water heater operates at full capacity, drawing substantial power and using more water volume to achieve and maintain desired temperature, while the prolonged shower time increases overall resource drain."
                },
                {
                    "name": "Quick wipe-down with washcloth",
                    "cost": {
                        "water": 5,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "Using a damp washcloth requires minimal water, typically just enough to moisten the cloth. The reduced water usage comes at the cost of personal comfort and thorough cleaning, resulting in lower water consumption but a slight negative impact on personal health and hygiene."
                }
            ]
        },
        {
            "id": 2,
            "time": "7:00 AM",
            "title": "Breakfast",
            "description": "You stand in your kitchen, surveying the limited options before you. With supply chains becoming increasingly unpredictable, each meal requires careful consideration of both nutrition and resource usage. Your breakfast choice could set the tone for the entire day.",
            "options": [
                {
                    "name": "Microwave instant oatmeal",
                    "cost": {
                        "water": 0,
                        "electricity": 5,
                        "hp": 5
                    },
                    "justification": "Microwaving requires minimal electricity, typically using around 600-1200 watts for a short duration. Instant oatmeal needs minimal preparation time, translating to low energy consumption while providing basic nutritional intake."
                },
                {
                    "name": "Cook full breakfast",
                    "cost": {
                        "water": 10,
                        "electricity": 15,
                        "hp": 0
                    },
                    "justification": "A full breakfast involves multiple cooking appliances like stoves and ovens, consuming significant electricity. Additional water is used for washing ingredients, cooking, and cleaning, making this option the most resource-intensive but nutritionally complete choice."
                },
                {
                    "name": "Cold breakfast",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "Consuming a cold breakfast like cereal or pre-prepared items requires no energy input whatsoever. However, the lack of hot preparation and potentially reduced food quality results in a negative health impact due to lower nutritional value and less satisfying meal."
                }
            ]
        },
        {
            "id": 3,
            "time": "1:00 PM",
            "title": "Work Environment",
            "description": "The merciless afternoon sun transforms your workspace into a challenge of endurance. The city's strained power grid groans under the collective burden of millions seeking relief from the heat. As the temperature climbs, you're faced with the daily dilemma of balancing comfort against conservation.",
            "options": [
                {
                    "name": "Use fan",
                    "cost": {
                        "water": 0,
                        "electricity": 10,
                        "hp": 5
                    },
                    "justification": "Fans consume relatively low electricity, typically 50-100 watts, providing basic air circulation. While less effective than air conditioning, they offer some cooling with minimal energy drain, making them a resource-efficient cooling solution."
                },
                {
                    "name": "Use air conditioning",
                    "cost": {
                        "water": 0,
                        "electricity": 25,
                        "hp": 0
                    },
                    "justification": "Air conditioning units consume substantial electricity, often ranging from 500-1500 watts, depending on size and efficiency. The comprehensive cooling comes at a high energy cost, potentially stressing the electrical grid and causing significant resource depletion."
                },
                {
                    "name": "Open windows",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "Opening windows uses no electricity but exposes you to external heat and humidity. The lack of active cooling results in physical discomfort and potential health impacts from heat stress, represented by the negative health points."
                }
            ]
        },
        {
            "id": 4,
            "time": "6:00 PM",
            "title": "Dinner Preparation",
            "description": "Evening light filters through your windows as you step into your kitchen, the day's challenges still fresh in your mind. The contents of your pantry tell a story of careful rationing and thoughtful planning. Your evening meal - once a simple affair of preference and craving - has evolved into a delicate equation of resource management.",
            "options": [
                {
                    "name": "Cook fresh meal",
                    "cost": {
                        "water": 10,
                        "electricity": 20,
                        "hp": 0
                    },
                    "justification": "Cooking a fresh meal requires multiple appliances like stoves, ovens, and potentially microwaves, consuming significant electricity. Water is used for ingredient preparation, cooking, and cleaning, making this the most resource-intensive but nutritionally complete option."
                },
                {
                    "name": "Eat preserved foods",
                    "cost": {
                        "water": 0,
                        "electricity": 5,
                        "hp": 5
                    },
                    "justification": "Preserved foods require minimal heating, typically using a microwave or minimal stove time, thus consuming low electricity. However, the preserved nature of the food results in lower nutritional value and potential health compromises."
                },
                {
                    "name": "Cold sandwich",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "A cold sandwich requires no energy input whatsoever, representing the most resource-conservative option. The lack of preparation and potentially limited nutritional variety results in a negative health impact due to reduced food quality and satisfaction."
                }
            ]
        },
        {
            "id": 5,
            "time": "9:00 PM",
            "title": "Evening Comfort",
            "description": "Night brings little relief from the day's heat, and your thoughts turn to securing restful sleep in these challenging conditions. The darkness outside is punctuated by the dim lights of other homes, each facing the same difficult choices. Your decision about tonight's sleeping conditions will affect not only your rest but your readiness for tomorrow's challenges.",
            "options": [
                {
                    "name": "Sleep with AC",
                    "cost": {
                        "water": 0,
                        "electricity": 30,
                        "hp": 0
                    },
                    "justification": "Running air conditioning throughout the night consumes the most electricity, typically 500-1500 watts continuously. The extended operation time multiplies the energy consumption, representing the most resource-intensive cooling method with potential broader infrastructure implications."
                },
                {
                    "name": "Use fan overnight",
                    "cost": {
                        "water": 0,
                        "electricity": 15,
                        "hp": 5
                    },
                    "justification": "Fans consume lower electricity when running continuously, around 50-100 watts. They provide basic air circulation and mild cooling, offering a compromise between comfort and resource conservation with moderate energy expenditure."
                },
                {
                    "name": "Open windows",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "Opening windows uses no electricity but exposes you to external temperature variations and potential humidity. The lack of active cooling results in disrupted sleep and physical discomfort from environmental conditions, represented by the negative health points."
                }
            ]
        }
    ]
}