{
    "game_title": "DJKAT CYOA",
    "scenarios": [
        {
            "id": 1,
            "time": "6:00 AM",
            "title": "Wake Up",
            "description": "Sixty days into The Disruption, the morning air hangs heavy with uncertainty as you rise. The prolonged crisis has pushed the city to its limits as local infrastructure struggles to provide even a fraction of the water and electricity needed to meet demand. Through your window, the dawn breaks over a community learning to scrape by, each day harder than the last. As you prepare for your morning routine, every drop of water and every volt of electricity feels more precious than ever, serving as a reminder of how fragile the comforts you once took for granted truly are.",
            "image_path": "scene1/scenario.png",
            "options": [
                {
                    "image_path": "scene1/6AM_OPTION_1.png",
                    "name": "Skip washing up",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 20
                    },
                    "justification": "Skipping cleaning altogether saves both water and electricity entirely but comes at the expense of personal hygiene and health. Over time, this could lead to discomfort and potential health risks."
                },
                {
                    "image_path": "scene1/6AM_OPTION_3.png",
                    "name": "Quick wipe-down with washcloth",
                    "cost": {
                        "water": 20,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "Using a damp washcloth requires minimal water, typically just enough to moisten the cloth. The reduced water usage comes at the cost of personal comfort and thorough cleaning, resulting in lower water consumption but a slight negative impact on personal health and hygiene."
                },
                {
                    "image_path": "scene1/6AM_OPTION_2.png",
                    "name": "Take a hot shower",
                    "cost": {
                        "water": 30,
                        "electricity": 10,
                        "hp": 0
                    },
                    "justification": "Hot water requires extensive energy to heat, consuming both water and electricity. The water heater operates at full capacity, drawing substantial power and using more water volume to achieve and maintain desired temperature, while the prolonged shower time increases overall resource drain."
                }
            ]
        },
        {
            "id": 2,
            "time": "7:00 AM",
            "title": "Breakfast",
            "description": "You stand in your kitchen, surveying the limited options before you. With supply chains becoming increasingly unpredictable, each meal requires careful consideration of both nutrition and resource usage. Your breakfast choice could set the tone for the entire day.",
            "image_path": "scene2/scenario.png",
            "options": [
                {
                    "image_path": "scene2/7AM_OPTION_3.png",
                    "name": "Skip breakfast",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 20
                    },
                    "justification": "Skipping breakfast entirely saves all resources but comes at a significant cost to personal health and energy levels. The lack of morning nutrition can lead to fatigue and reduced productivity throughout the day."
                },
                {
                    "image_path": "scene2/7AM_OPTION_1.png",
                    "name": "Microwave instant oatmeal",
                    "cost": {
                        "water": 10,
                        "electricity": 10,
                        "hp": 10
                    },
                    "justification": "Microwaving requires minimal electricity, typically using around 600-1200 watts for a short duration. Instant oatmeal needs minimal preparation time, translating to low energy consumption while providing basic nutritional intake."
                },
                {
                    "image_path": "scene2/7AM_OPTION_2.png",
                    "name": "Cook full breakfast",
                    "cost": {
                        "water": 20,
                        "electricity": 20,
                        "hp": 0
                    },
                    "justification": "A full breakfast involves multiple cooking appliances like stoves and ovens, consuming significant electricity. Additional water is used for washing ingredients, cooking, and cleaning, making this option the most resource-intensive but nutritionally complete choice."
                }
            ]
        },
        {
            "id": 3,
            "time": "1:00 PM",
            "title": "Work Environment",
            "description": "The merciless afternoon sun transforms your workspace into a challenge of endurance. The city's strained power grid groans under the collective burden of millions seeking relief from the heat. As the temperature climbs, you're faced with the daily dilemma of balancing comfort against conservation.",
            "image_path": "scene3/scenario.png",
            "options": [
                {
                    "image_path": "scene3/1PM_OPTION_3.png",
                    "name": "Open windows",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 20
                    },
                    "justification": "Opening windows uses no electricity but exposes you to external heat and humidity. The lack of active cooling results in physical discomfort and potential health impacts from heat stress, represented by the negative health points."
                },
                {
                    "image_path": "scene3/1PM_OPTION_1.png",
                    "name": "Use fan",
                    "cost": {
                        "water": 0,
                        "electricity": 20,
                        "hp": 10
                    },
                    "justification": "Fans consume relatively low electricity, typically 50-100 watts, providing basic air circulation. While less effective than air conditioning, they offer some cooling with minimal energy drain, making them a resource-efficient cooling solution."
                },
                {
                    "image_path": "scene3/1PM_OPTION_2.png",
                    "name": "Use air conditioning",
                    "cost": {
                        "water": 0,
                        "electricity": 40,
                        "hp": 0
                    },
                    "justification": "Air conditioning units consume substantial electricity, often ranging from 500-1500 watts, depending on size and efficiency. The comprehensive cooling comes at a high energy cost, potentially stressing the electrical grid and causing significant resource depletion."
                }
            ]
        },
        {
            "id": 4,
            "time": "6:00 PM",
            "title": "Evening Chores",
            "description": "The evening light streams through your windows as you survey your living space. Dust motes dance in the air, and the floor shows signs of the day's activities. In this resource-conscious world, even basic cleaning tasks require careful consideration of their environmental impact. As you contemplate your cleaning options, you must balance the necessity of maintaining a hygienic living space against the precious resources each method consumes.",
            "image_path": "scene4/scenario.png",
            "options": [
                {
                    "image_path": "scene4/6PM_OPTION_3.png",
                    "name": "Basic sweeping",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 20
                    },
                    "justification": "Manual sweeping does not require electricity or water, making it the most resource-conservative option. However, the physical strain of sweeping combined with less effective dust control results in higher negative health impact. The inability to deep clean and the stirring up of dust particles without proper containment contributes to the health penalty."
                },
                {
                    "image_path": "scene4/6PM_OPTION_1.png",
                    "name": "Vacuum cleaning",
                    "cost": {
                        "water": 0,
                        "electricity": 20,
                        "hp": 10
                    },
                    "justification": "A typical vacuum cleaner consumes significant electricity, ranging from 500-1200 watts during operation. While it provides thorough cleaning, the high power consumption makes this the most resource-intensive option. The health cost reflects the physical effort required to operate the vacuum cleaner."
                },
                {
                    "image_path": "scene4/6PM_OPTION_2.png",
                    "name": "Sweep and mop",
                    "cost": {
                        "water": 20,
                        "electricity": 0,
                        "hp": 10
                    },
                    "justification": "Traditional mopping requires moderate water usage for both cleaning and rinsing the mop. While using no electricity, the physical exertion and exposure to dust during sweeping can cause minor respiratory irritation and fatigue."
                }
            ]
        },
        {
            "id": 5,
            "time": "9:00 PM",
            "title": "Evening Unwinding",
            "description": "The day's challenges slowly fade as you seek a moment of respite in your home. The evening hours offer a precious window for relaxation, but even leisure activities now require careful consideration of resource usage. As you contemplate how to unwind, you weigh the comfort of entertainment against its environmental cost.",
            "image_path": "scene5/scenario.png",
            "options": [
                {
                    "image_path": "scene5/9PM_OPTION_3.png",
                    "name": "Go straight to sleep",
                    "cost": {
                        "water": 0,
                        "electricity": 0,
                        "hp": 20
                    },
                    "justification": "While using no resources, going to bed immediately after daily activities without any wind-down period disrupts natural circadian rhythms and stress recovery processes. The abrupt transition from activity to sleep can lead to poor sleep quality, increased stress levels, and inadequate mental recovery, resulting in negative health impacts that carry over to the next day."
                },
                {
                    "image_path": "scene5/9PM_OPTION_2.png",
                    "name": "Read a book with lamp",
                    "cost": {
                        "water": 0,
                        "electricity": 20,
                        "hp": 10
                    },
                    "justification": "Reading with a small LED lamp requires minimal electricity, usually 5-15 watts. This option provides mental stimulation and relaxation while maintaining minimal resource consumption, offering a balanced approach to evening leisure."
                },
                {
                    "image_path": "scene5/9PM_OPTION_1.png",
                    "name": "Play with gaming console",
                    "cost": {
                        "water": 0,
                        "electricity": 40,
                        "hp": 0
                    },
                    "justification": "Using devices like TVs and gaming consoles consumes moderate electricity, typically 100-300 watts depending on the device."
                }
            ]
        }
    ]
}